Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/arrests/index.html.txt.tmx
Source language: en
Languages: ga

source: What happens if you are arrested in Ireland?
ga: Cad a tharlaíonn nuair a ghabhtar in Éirinn thú?

source: Find out more about warrants and the rules governing arrests
ga: Aimsigh breis faisnéise faoi bharántais agus na rialacha a rialaíonn gabhálacha

source: What are the different types of bail, the refusal of bail, and the consquences of breaching bail?
ga: Cad iad na saghsanna éagsúla de bhannaí, bannaí a dhiúltú, agus na hiarmhairtí a bhaineann le bannaí a shárú?

source: What is the legal basis for detaining you after you have been arrested?
ga: Tá cur síos anseo ar an dlí a bhaineann le duine a choinneáil tar éis é/í a ghabháil

source: Unlawful arrest and detention
ga: Gabháil agus coinneáil neamhdhleathach

source: This document discusses what constitutes unlawful arrest and detention in Ireland and how evidence produced from it is treated in court
ga: Tá plé déanta anseo ar a bhfuil i gceist le gabháil agus coinneáil neamhdhleathach agus ar an mbealach a chaitear le fianaise a bhailítear dá bharr sna cúirteanna

source: What are the rules about your treatment when you have been arrested and are in Garda custody in Ireland?
ga: Tá cur síos anseo ar mar a chaitear le duine atá faoi choimeád

source: What are your rights if you have been arrested and are being interviewed by the Garda Síochána (Irish police force)?
ga: Tá cur síos anseo ar na cearta atá ag daoine atá gafa nuair atá agallamh dhá chur ag na Gardaí orthu

source: This document describes what happens when a suspect in a criminal investigation makes a statement
ga: Tá cur síos anseo ar a tharlaíonn má dhéanann duine a bhfuil amhras coire air/uirthi ráiteas

source: Right to silence in criminal cases
ga: Ceart chun tosta i gcásanna coiriúla

source: The Irish Constitution provides protection for everyone against self-incrimination
ga: Déanann Bunreacht na hÉireann gach duine a chosaint i gcoinne féin-ionchoirithe

source: Find out more here
ga: Tá breis faisnéise ar fáil anseo

source: Voluntary confessions to the Gardai can be used as evidence against you in a trial
ga: Tá cur síos anseo ar na rialacha a bhaineann le hadmhálacha

source: What is the role of the Gardai in questioning and surveillance of the public?
ga: Tá cur síos anseo ar an ról atá ag Gardaí i gceistiú agus faire ar an bpobal

source: The Gardai have certain powers to search premises and persons when they are investigating a crime in Ireland
ga: Tá cur síos anseo ar na cumhachtaí atá ag na Gardaí áitribh agus daoine a chuardach

source: Extradition to and from Ireland
ga: Eiseachadadh chuig agus ó Éirinn

source: What is extradition and when is someone extradited from Ireland to another country?
ga: Cad é eiseachadadh agus cathain a dhéantar duine a eiseachadadh ó Éirinn go tír eile?

source: The law on extradition between Ireland and other countries including information on European Arrest Warrants
ga: An dlí maidir le heiseachadadh idir Éirinn agus tíortha eile, lena n-áirítear faisnéis ar Bharántais Ghabhála Eorpacha

source: Most Read in "Justice"
ga: Ábhar is mó éilimh i "Dlí"

source: Alcohol and the law
ga: Alcól agus an dlí
